app/Repositories/Books/BooksRepository.php

    public function selectToFilter(BookIndexDTO $data): Collection
    {
        $resul = DB::table('books')
            ->select(
                'books.id',
                'books.name',
                'books.created_at',
                'year',
                'lang',
                'pages',
                'category_id',
                'categories.name as category_name',
            )
            ->whereBetween(
                'books.created_at',
                [$data->getStartDate(), $data->getEndDate()]
            )
            ->when($data->getYear(), function (Builder $query, $year) {
                $query->where('year', '=', $year);
            })
            ->when($data->getLang(), function (Builder $query, $lang) {
                $query->where('lang', '=', $lang);
            })
            ->join('categories', 'categories.id', '=', 'books.id')
            ->get();
---
select `books`.`id`, `books`.`name`, `books`.`created_at`, `year`, `lang`, `pages`, `category_id`, `categories`.`name` as `category_name` from `books` inner join `categories` on `categories`.`id` = `books`.`id` where `books`.`created_at` between '2010-07-14 21:33:32' and '2023-07-14 21:10:20' and `books`.`id` > 200 limit 5